Tekla.Structures.Model.ControlPoint
The ControlPoint class defines a user defined point helping in modeling work.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Point point = new Point(6000,6000,0);
ControlPoint controlpoint = new ControlPoint(point);
bool Result = false;
Result = controlpoint.Insert();
}
}

Tekla.Structures.Model.ControlPoint.point
Defines the position of the modeling aid point.

Tekla.Structures.Model.ControlPoint.#ctor
Initializes a new instance of the Tekla.Structures.Model.ControlPoint class with zero members.

Tekla.Structures.Model.ControlPoint.#ctor(Tekla.Structures.Geometry3d.Point)
Initializes a new instance of the Tekla.Structures.Model.ControlPoint class with an existing point.
existPoint: An existing point

Tekla.Structures.Model.ControlPoint.Point
Gets or sets the position of the control point.

Tekla.Structures.Model.ControlPoint.Insert
Inserts the control point into the model.
Returns: True on success.

Tekla.Structures.Model.ControlPoint.Select
Selects the control point with the given Identifier.
Returns: True on success.

Tekla.Structures.Model.ControlPoint.Modify
Modifies the control point with the given Identifier.
Returns: True on success.

Tekla.Structures.Model.ControlPoint.Delete
Deletes the control point with the given Identifier.
Returns: True on success.